ssenja/TMM737/BSP/GD32H7xx_HAL/INC/gd32h73x_75x_enet.h
/* PHY basic control register */
#define PHY_RESET                        ((uint16_t)0x8000U)                    /*!< PHY reset */
#define PHY_LOOPBACK                     ((uint16_t)0x4000U)                    /*!< enable phy loop-back mode */
#define PHY_FULLDUPLEX_100M              ((uint16_t)0x2100U)                    /*!< configure speed to 100 Mbit/s and the full-duplex mode */
#define PHY_HALFDUPLEX_100M              ((uint16_t)0x2000U)                    /*!< configure speed to 100 Mbit/s and the half-duplex mode */
#define PHY_FULLDUPLEX_10M               ((uint16_t)0x0100U)                    /*!< configure speed to 10 Mbit/s and the full-duplex mode */
#define PHY_HALFDUPLEX_10M               ((uint16_t)0x0000U)                    /*!< configure speed to 10 Mbit/s and the half-duplex mode */
#define PHY_AUTONEGOTIATION              ((uint16_t)0x1000U)                    /*!< enable auto-negotiation function */
#define PHY_RESTART_AUTONEGOTIATION      ((uint16_t)0x0200U)                    /*!< restart auto-negotiation function */
#define PHY_POWERDOWN                    ((uint16_t)0x0800U)                    /*!< enable the power down mode */
#define PHY_ISOLATE                      ((uint16_t)0x0400U)                    /*!< isolate PHY from MII */

/* PHY basic status register */
#define PHY_AUTONEGO_COMPLETE            ((uint16_t)0x0020U)                    /*!< auto-negotioation process completed */
#define PHY_LINKED_STATUS                ((uint16_t)0x0004U)                    /*!< valid link established */
#define PHY_JABBER_DETECTION             ((uint16_t)0x0002U)                    /*!< jabber condition detected */

#if(PHY_TYPE == LAN8700)
#define PHY_SR                           31U                                    /*!< tranceiver status register */
#define PHY_SPEED_STATUS                 ((uint16_t)0x0004U)                    /*!< configured information of speed: 10Mbit/s */
#define PHY_DUPLEX_STATUS                ((uint16_t)0x0010U)                    /*!< configured information of duplex: full-duplex */
#elif(PHY_TYPE == DP83848)
#define PHY_SR                           16U                                    /*!< tranceiver status register */
#define PHY_SPEED_STATUS                 ((uint16_t)0x0002U)                    /*!< configured information of speed: 10Mbit/s */
#define PHY_DUPLEX_STATUS                ((uint16_t)0x0004U)                    /*!< configured information of duplex: full-duplex */
#endif /* PHY_TYPE */

#endif /* _PHY_H_ */

/* function declarations */
/* main function */
/* deinitialize the ENET, and reset structure parameters for ENET initialization */
void enet_deinit(uint32_t enet_periph);
/* reset the ENET initpara struct, call it before using enet_initpara_config() */
void enet_initpara_reset(void);
/* configure the parameters which are usually less cared for initialization */
void enet_initpara_config(enet_option_enum option, uint32_t para);
/* initialize ENET peripheral with generally concerned parameters and the less cared parameters */
ErrStatus enet_init(uint32_t enet_periph, enet_mediamode_enum mediamode, enet_chksumconf_enum checksum, enet_frmrecept_enum recept);
/* reset all core internal registers located in CLK_TX and CLK_RX */
ErrStatus enet_software_reset(uint32_t enet_periph);
/* check receive frame valid and return frame size */
uint32_t enet_rxframe_size_get(uint32_t enet_periph);
/* initialize the dma tx/rx descriptors's parameters in chain mode */
void enet_descriptors_chain_init(uint32_t enet_periph, enet_dmadirection_enum direction);
/* initialize the dma tx/rx descriptors's parameters in ring mode */
void enet_descriptors_ring_init(uint32_t enet_periph, enet_dmadirection_enum direction);
/* handle current received frame data to application buffer */
ErrStatus enet_frame_receive(uint32_t enet_periph, uint8_t buffer[], uint32_t bufsize);
/* handle current received frame but without data copy to application buffer */
#define ENET_NOCOPY_FRAME_RECEIVE(enet_periph)         enet_frame_receive((enet_periph), NULL, 0U)
/* handle application buffer data to transmit it */
ErrStatus enet_frame_transmit(uint32_t enet_periph, uint8_t buffer[], uint32_t length);
/* handle current transmit frame but without data copy from application buffer */
#define ENET_NOCOPY_FRAME_TRANSMIT(enet_periph, len)     enet_frame_transmit((enet_periph), NULL, (len))
/* configure the transmit IP frame checksum offload calculation and insertion */
ErrStatus enet_transmit_checksum_config(enet_descriptors_struct *desc, uint32_t checksum);
/* ENET Tx and Rx function enable (include MAC and DMA module) */
void enet_enable(uint32_t enet_periph);
/* ENET Tx and Rx function disable (include MAC and DMA module) */
void enet_disable(uint32_t enet_periph);
/* configure MAC address */
void enet_mac_address_set(uint32_t enet_periph, enet_macaddress_enum mac_addr, uint8_t paddr[]);
/* get MAC address */
ErrStatus enet_mac_address_get(uint32_t enet_periph, enet_macaddress_enum mac_addr, uint8_t paddr[], uint8_t bufsize);

/* MAC function */
/* ENET Tx function enable (include MAC and DMA module) */
void enet_tx_enable(uint32_t enet_periph);
/* ENET Tx function disable (include MAC and DMA module) */
void enet_tx_disable(uint32_t enet_periph);
/* ENET Rx function enable (include MAC and DMA module) */
void enet_rx_enable(uint32_t enet_periph);
/* ENET Rx function disable (include MAC and DMA module) */
void enet_rx_disable(uint32_t enet_periph);
/* put registers value into the application buffer */
void enet_registers_get(uint32_t enet_periph, enet_registers_type_enum type, uint32_t preg[], uint32_t num);
/* get the enet debug status from the debug register */
uint32_t enet_debug_status_get(uint32_t enet_periph, uint32_t mac_debug);
/* enable the MAC address filter */
void enet_address_filter_enable(uint32_t enet_periph, enet_macaddress_enum mac_addr);
/* disable the MAC address filter */
void enet_address_filter_disable(uint32_t enet_periph, enet_macaddress_enum mac_addr);
/* configure the MAC address filter */
void enet_address_filter_config(uint32_t enet_periph, enet_macaddress_enum mac_addr, uint32_t addr_mask, uint32_t filter_type);
/* PHY interface configuration (configure SMI clock and reset PHY chip) */
ErrStatus enet_phy_config(uint32_t enet_periph);
/* write to/read from a PHY register */
ErrStatus enet_phy_write_read(uint32_t enet_periph, enet_phydirection_enum direction, uint16_t phy_address, uint16_t phy_reg, uint16_t *pvalue);
/* enable the loopback function of phy chip */
ErrStatus enet_phyloopback_enable(uint32_t enet_periph, uint16_t phy_address);
/* disable the loopback function of phy chip */
ErrStatus enet_phyloopback_disable(uint32_t enet_periph, uint16_t phy_address);
/* enable ENET forward feature */
void enet_forward_feature_enable(uint32_t enet_periph, uint32_t feature);
/* disable ENET forward feature */
void enet_forward_feature_disable(uint32_t enet_periph, uint32_t feature);
/* enable ENET filter feature */
void enet_filter_feature_enable(uint32_t enet_periph, uint32_t feature);
/* disable ENET filter feature */
void enet_filter_feature_disable(uint32_t enet_periph, uint32_t feature);

/* flow control function */
/* generate the pause frame, ENET will send pause frame after enable transmit flow control */
ErrStatus enet_pauseframe_generate(uint32_t enet_periph);
/* configure the pause frame detect type */
void enet_pauseframe_detect_config(uint32_t enet_periph, uint32_t detect);
/* configure the pause frame parameters */
void enet_pauseframe_config(uint32_t enet_periph, uint32_t pausetime, uint32_t pause_threshold);
/* configure the threshold of the flow control(deactive and active threshold) */
void enet_flowcontrol_threshold_config(uint32_t enet_periph, uint32_t deactive, uint32_t active);
/* enable ENET flow control feature */
void enet_flowcontrol_feature_enable(uint32_t enet_periph, uint32_t feature);
/* disable ENET flow control feature */
void enet_flowcontrol_feature_disable(uint32_t enet_periph, uint32_t feature);

/* DMA function */
/* get the dma transmit/receive process state */
uint32_t enet_dmaprocess_state_get(uint32_t enet_periph, enet_dmadirection_enum direction);
/* poll the dma transmission/reception enable */
void enet_dmaprocess_resume(uint32_t enet_periph, enet_dmadirection_enum direction);
/* check and recover the Rx process */
void enet_rxprocess_check_recovery(uint32_t enet_periph);
/* flush the ENET transmit fifo, and wait until the flush operation completes */
ErrStatus enet_txfifo_flush(uint32_t enet_periph);
/* get the transmit/receive address of current descriptor, or current buffer, or descriptor table */
uint32_t enet_current_desc_address_get(uint32_t enet_periph, enet_desc_reg_enum addr_get);
/* get the Tx or Rx descriptor information */
uint32_t enet_desc_information_get(uint32_t enet_periph, enet_descriptors_struct *desc, enet_descstate_enum info_get);
/* get the number of missed frames during receiving */
void enet_missed_frame_counter_get(uint32_t enet_periph, uint32_t *rxfifo_drop, uint32_t *rxdma_drop);

